[
  {
    "content": "Great insights! JavaScript frameworks have indeed transformed web development.",
    "user_id": 2,
    "post_id": 1
  },
  {
    "content": "I've learned a lot from mastering CSS Flexbox layouts. Thanks for the informative post!",
    "user_id": 3,
    "post_id": 2
  },
  {
    "content": "Node.js is an amazing tool for building server-side applications. Looking forward to diving deeper into it!",
    "user_id": 1,
    "post_id": 3
  },
  {
    "content": "Debugging can be challenging, but it's crucial for writing robust code. Thanks for sharing your insights!",
    "user_id": 4,
    "post_id": 4
  },
  {
    "content": "I agree! JavaScript frameworks have truly revolutionized the way we build web applications.",
    "user_id": 2,
    "post_id": 1
  },
  {
    "content": "CSS Flexbox is a game-changer in modern web development. Thanks for the detailed explanation!",
    "user_id": 3,
    "post_id": 2
  },
  {
    "content": "Node.js has been on my learning list for a while. Your post motivated me to finally start!",
    "user_id": 1,
    "post_id": 3
  },
  {
    "content": "Debugging is an art, indeed. Your tips are very helpful!",
    "user_id": 4,
    "post_id": 4
  },
  {
    "content": "Thanks for the comprehensive overview! I'm excited to start using JavaScript frameworks in my projects.",
    "user_id": 2,
    "post_id": 1
  },
  {
    "content": "CSS Flexbox is a powerful layout tool that every developer should master. Your post makes it easy to understand!",
    "user_id": 3,
    "post_id": 2
  },
  {
    "content": "I appreciate the step-by-step guide! It's perfect for beginners like me who want to learn Node.js.",
    "user_id": 1,
    "post_id": 3
  },
  {
    "content": "Your debugging tips are invaluable! I'll definitely apply them in my coding sessions.",
    "user_id": 4,
    "post_id": 4
  },
  {
    "content": "JavaScript frameworks have made web development more efficient and enjoyable. Thanks for sharing your expertise!",
    "user_id": 2,
    "post_id": 1
  },
  {
    "content": "CSS Flexbox simplifies layout design and enhances user experience. Your post explained it perfectly!",
    "user_id": 3,
    "post_id": 2
  },
  {
    "content": "I'm excited to explore the world of Node.js further. Your guide is a great starting point!",
    "user_id": 1,
    "post_id": 3
  }
]
